---
type: ConnectorElement
namespace: Autodesk.Revit.DB
version: 2024
members: 22
tags: [revit-api, class]
---

# ConnectorElement

`Autodesk.Revit.DB.ConnectorElement` · Revit 2024 · 22 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AssignAsPrimary | — | `public void AssignAsPrimary ()` |
| Method | ChangeHostReference | — | `` |
| Method | CreateCableTrayConnector | — | `` |
| Method | CreateConduitConnector | — | `` |
| Method | CreateDuctConnector | — | `` |
| Method | CreateElectricalConnector | — | `` |
| Method | CreatePipeConnector | — | `` |
| Method | FlipDirection | 2014 | `public void FlipDirection ()` |
| Method | GetLinkedConnectorElement | 2013 | `public ConnectorElement GetLinkedConnectorElement ()` |
| Method | IsSystemClassificationValid | 2014 | `public bool IsSystemClassificationValid ( MEPSystemClassification systemClassification )` |
| Method | SetLinkedConnectorElement | 2013 | `public void SetLinkedConnectorElement ( ConnectorElement otherConnector )` |
| Property | CoordinateSystem | — | `public virtual Transform CoordinateSystem { get ; }` |
| Property | Direction | 2014 | `public XYZ Direction { get ; }` |
| Property | Domain | — | `public virtual Domain Domain { get ; }` |
| Property | Height | — | `public virtual double Height { get ; }` |
| Property | IsPrimary | — | `public bool IsPrimary { get ; }` |
| Property | Origin | — | `public virtual XYZ Origin { get ; }` |
| Property | Parameter | — | `` |
| Property | Radius | — | `public virtual double Radius { get ; }` |
| Property | Shape | — | `public virtual ConnectorProfileType Shape { get ; }` |
| Property | SystemClassification | 2014 | `public MEPSystemClassification SystemClassification { get ; set ; }` |
| Property | Width | — | `public virtual double Width { get ; }` |